app/controllers/categories_controller.rb

  def create
  	@cat = Category.new(params[:category])
  	@cat.save!
---
INSERT INTO "categories" ("color", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["color", "Blue"], ["created_at", Tue, 18 Nov 2014 07:20:23 UTC +00:00], ["name", "Location"], ["updated_at", Tue, 18 Nov 2014 07:20:23 UTC +00:00]]