app/controllers/cities_controller.rb

INSERT INTO "cities" ("created_at", "english", "updated_at", "urdu") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Mon, 27 Oct 2014 12:34:44 UTC +00:00], ["english", "Lahore"], ["updated_at", Mon, 27 Oct 2014 12:34:44 UTC +00:00], ["urdu", nil]]
---
  def create
    city = City.new(params[:city])
    city.save!

SELECT "collections".* FROM "collections"
SELECT "collections".* FROM "collections" WHERE "collections"."name" = 'Lahore' LIMIT 1
---
  def location
    #return render json: params[:text]
    @data = Collection.all
    @str = params[:text].to_s
    @data.each do |f|
      @temp = Collection.find_by_name(f.name).category.color

INSERT INTO "cities" ("created_at", "english", "type", "updated_at", "urdu") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 29 Oct 2014 07:36:23 UTC +00:00], ["english", "Bridge of Allan"], ["type", "country"], ["updated_at", Wed, 29 Oct 2014 07:36:23 UTC +00:00], ["urdu", nil]]
---
  def data

  require 'addressable/uri'

  apikey = "AIzaSyBlwk5eKfI3pzit3zF2hZOJoB21cJojfMw"
  query = [{'id' => nil, 'name' => nil, 'type' => '/location/country'}]
  l = 200
  url = Addressable::URI.parse('https://www.googleapis.com/freebase/v1/mqlread')
  url.query_values = {
        'query' => query.to_json,
        'key'=> apikey,
        'lang' => "/lang/en",
        'limit' => l
    }
  @topic = HTTParty.get(url, :format => :json)
  puts '---'*80
  @topic['result'].each { |toic|
  a = City.new
  a.english = toic['name']
  a.typ = 'country'
  a.save!

INSERT INTO "people" ("created_at", "eng_name", "updated_at", "urdu_name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 29 Oct 2014 08:54:17 UTC +00:00], ["eng_name", "Jack Abramoff"], ["updated_at", Wed, 29 Oct 2014 08:54:17 UTC +00:00], ["urdu_name", nil]]
---
  @top['result'].each { |toic|
  z = People.new
  z.eng_name = toic['name']
  z.save!

SELECT "cities".* FROM "cities"
---
  def loc
    @loc = City.all

SELECT "people".* FROM "people"
---
  def people

    @p = People.all