app/controllers/cities_controller.rb

  def location
    @a = City.all
---
SELECT "cities".* FROM "cities"