app/controllers/collections_controller.rb

  def upload
  	@categories = Category.all
---
SELECT "categories".* FROM "categories"

  def import
  	file = params[:file]
  	category = Category.find_by_name(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Location' LIMIT 1